Revit 2026 API

# BindingMapClear Method

---

This method is used to remove all the items in the map.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override void Clear()
```
```vb
Public Overrides Sub Clear
```
```cpp
public:
virtual void Clear() override
```
```fsharp
abstract Clear : unit -> unit
override Clear : unit -> unit
```

The method Clear inherited from base class is not permitted for this class. A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown.

#### Reference

BindingMap Class

Autodesk.Revit.DB Namespace